// Завдання 2

// Написати розв’язок нижче описаного завдання за допомогою function declaration:
// Створити функцію яка буде приймати одне число.
// В середині функції перевіряємо чи це число є простим.
// Після перевірки виводимо повідомлення в console.log().
// ------------------------------------------------------------------------------------------

function num (number) {
    for(let i = 2; i < number; i++) {
          if( number % i == 0)
          return false;
    }
    return number > 1;
}
console.log(num(5));
console.log(num(6));


