// Завдання 1

// Написати розв’язок нижче описаного завдання за допомогою конструкції switch:
// ⦁	Користувач вводить число в prompt
// ⦁	Після введення числа вистрибує алерт з оголошенням пори року до якої відноситься число (номер місяця) що ввів користувач.
// ⦁	Якщо число не входить в діапазон від 1 до 12 тоді виводить що це неможливо.
// ------------------------------------------------------------------------------------------


const number = +prompt('Введіть число');

switch (number) {
  case 12:
  case 1:
  case 2:
    alert('Зима');
    break;

  case 3:
  case 4:
  case 5:
    alert('Весна');
    break;

  case 6:
  case 7:
  case 8:
    alert('Літо');
    break;

  case 9:
  case 10:
  case 11:
    alert('Осінь');
    break;
  
 default:
     alert('Це неможливо')

}